node {
  name: "X"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 256
        }
        dim {
          size: 256
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "y"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 256
        }
        dim {
          size: 256
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "mode"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 127.5
      }
    }
  }
}
node {
  name: "truediv"
  op: "RealDiv"
  input: "X"
  input: "truediv/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "truediv"
  input: "sub/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.24618297815322876
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.24618297815322876
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "layer1/conv_1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "layer1/conv_1/kernel/Initializer/random_uniform/max"
  input: "layer1/conv_1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "layer1/conv_1/kernel/Initializer/random_uniform/RandomUniform"
  input: "layer1/conv_1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "layer1/conv_1/kernel/Initializer/random_uniform/mul"
  input: "layer1/conv_1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Assign"
  op: "Assign"
  input: "layer1/conv_1/kernel"
  input: "layer1/conv_1/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/conv_1/kernel/read"
  op: "Identity"
  input: "layer1/conv_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "layer1/conv_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_1/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "layer1/conv_1/kernel/Regularizer/l2_regularizer/scale"
  input: "layer1/conv_1/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_1/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/conv_1/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/conv_1/bias/Assign"
  op: "Assign"
  input: "layer1/conv_1/bias"
  input: "layer1/conv_1/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/conv_1/bias/read"
  op: "Identity"
  input: "layer1/conv_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/bias"
      }
    }
  }
}
node {
  name: "layer1/conv_1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "layer1/conv_1/Conv2D"
  op: "Conv2D"
  input: "sub"
  input: "layer1/conv_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/conv_1/BiasAdd"
  op: "BiasAdd"
  input: "layer1/conv_1/Conv2D"
  input: "layer1/conv_1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "layer1/bn_1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer1/bn_1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_1/gamma/Assign"
  op: "Assign"
  input: "layer1/bn_1/gamma"
  input: "layer1/bn_1/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_1/gamma/read"
  op: "Identity"
  input: "layer1/bn_1/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/gamma"
      }
    }
  }
}
node {
  name: "layer1/bn_1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/bn_1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_1/beta/Assign"
  op: "Assign"
  input: "layer1/bn_1/beta"
  input: "layer1/bn_1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_1/beta/read"
  op: "Identity"
  input: "layer1/bn_1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/beta"
      }
    }
  }
}
node {
  name: "layer1/bn_1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/bn_1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_1/moving_mean/Assign"
  op: "Assign"
  input: "layer1/bn_1/moving_mean"
  input: "layer1/bn_1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_1/moving_mean/read"
  op: "Identity"
  input: "layer1/bn_1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer1/bn_1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_1/moving_variance/Assign"
  op: "Assign"
  input: "layer1/bn_1/moving_variance"
  input: "layer1/bn_1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_1/moving_variance/read"
  op: "Identity"
  input: "layer1/bn_1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/Switch"
  op: "Switch"
  input: "mode"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond/switch_t"
  op: "Identity"
  input: "layer1/bn_1/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond/switch_f"
  op: "Identity"
  input: "layer1/bn_1/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond/pred_id"
  op: "Identity"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond/Const"
  op: "Const"
  input: "^layer1/bn_1/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/Const_1"
  op: "Const"
  input: "^layer1/bn_1/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "layer1/bn_1/cond/FusedBatchNorm/Switch:1"
  input: "layer1/bn_1/cond/FusedBatchNorm/Switch_1:1"
  input: "layer1/bn_1/cond/FusedBatchNorm/Switch_2:1"
  input: "layer1/bn_1/cond/Const"
  input: "layer1/bn_1/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "layer1/conv_1/BiasAdd"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/BiasAdd"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "layer1/bn_1/gamma/read"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/gamma"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "layer1/bn_1/beta/read"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/beta"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "layer1/bn_1/cond/FusedBatchNorm_1/Switch"
  input: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_1"
  input: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_2"
  input: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_3"
  input: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "layer1/conv_1/BiasAdd"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_1/BiasAdd"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "layer1/bn_1/gamma/read"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/gamma"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "layer1/bn_1/beta/read"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/beta"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "layer1/bn_1/moving_mean/read"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "layer1/bn_1/moving_variance/read"
  input: "layer1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond/Merge"
  op: "Merge"
  input: "layer1/bn_1/cond/FusedBatchNorm_1"
  input: "layer1/bn_1/cond/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_1/cond/Merge_1"
  op: "Merge"
  input: "layer1/bn_1/cond/FusedBatchNorm_1:1"
  input: "layer1/bn_1/cond/FusedBatchNorm:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_1/cond/Merge_2"
  op: "Merge"
  input: "layer1/bn_1/cond/FusedBatchNorm_1:2"
  input: "layer1/bn_1/cond/FusedBatchNorm:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_1/cond_1/Switch"
  op: "Switch"
  input: "mode"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond_1/switch_t"
  op: "Identity"
  input: "layer1/bn_1/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond_1/switch_f"
  op: "Identity"
  input: "layer1/bn_1/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond_1/pred_id"
  op: "Identity"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_1/cond_1/Const"
  op: "Const"
  input: "^layer1/bn_1/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond_1/Const_1"
  op: "Const"
  input: "^layer1/bn_1/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/bn_1/cond_1/Merge"
  op: "Merge"
  input: "layer1/bn_1/cond_1/Const_1"
  input: "layer1/bn_1/cond_1/Const"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg/read"
  op: "Identity"
  input: "layer1/bn_1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg/Sub"
  op: "Sub"
  input: "layer1/bn_1/AssignMovingAvg/read"
  input: "layer1/bn_1/cond/Merge_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg/Mul"
  op: "Mul"
  input: "layer1/bn_1/AssignMovingAvg/Sub"
  input: "layer1/bn_1/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg"
  op: "AssignSub"
  input: "layer1/bn_1/moving_mean"
  input: "layer1/bn_1/AssignMovingAvg/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg_1/read"
  op: "Identity"
  input: "layer1/bn_1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg_1/Sub"
  op: "Sub"
  input: "layer1/bn_1/AssignMovingAvg_1/read"
  input: "layer1/bn_1/cond/Merge_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg_1/Mul"
  op: "Mul"
  input: "layer1/bn_1/AssignMovingAvg_1/Sub"
  input: "layer1/bn_1/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "layer1/bn_1/AssignMovingAvg_1"
  op: "AssignSub"
  input: "layer1/bn_1/moving_variance"
  input: "layer1/bn_1/AssignMovingAvg_1/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "layer1/relu1_1"
  op: "Relu"
  input: "layer1/bn_1/cond/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\010\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.20412415266036987
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20412415266036987
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "layer1/conv_2/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "layer1/conv_2/kernel/Initializer/random_uniform/max"
  input: "layer1/conv_2/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "layer1/conv_2/kernel/Initializer/random_uniform/RandomUniform"
  input: "layer1/conv_2/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Initializer/random_uniform"
  op: "Add"
  input: "layer1/conv_2/kernel/Initializer/random_uniform/mul"
  input: "layer1/conv_2/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 8
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Assign"
  op: "Assign"
  input: "layer1/conv_2/kernel"
  input: "layer1/conv_2/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/conv_2/kernel/read"
  op: "Identity"
  input: "layer1/conv_2/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "layer1/conv_2/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_2/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "layer1/conv_2/kernel/Regularizer/l2_regularizer/scale"
  input: "layer1/conv_2/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/kernel"
      }
    }
  }
}
node {
  name: "layer1/conv_2/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/conv_2/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/conv_2/bias/Assign"
  op: "Assign"
  input: "layer1/conv_2/bias"
  input: "layer1/conv_2/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/conv_2/bias/read"
  op: "Identity"
  input: "layer1/conv_2/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/bias"
      }
    }
  }
}
node {
  name: "layer1/conv_2/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "layer1/conv_2/Conv2D"
  op: "Conv2D"
  input: "layer1/relu1_1"
  input: "layer1/conv_2/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/conv_2/BiasAdd"
  op: "BiasAdd"
  input: "layer1/conv_2/Conv2D"
  input: "layer1/conv_2/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "layer1/bn_2/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer1/bn_2/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_2/gamma/Assign"
  op: "Assign"
  input: "layer1/bn_2/gamma"
  input: "layer1/bn_2/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_2/gamma/read"
  op: "Identity"
  input: "layer1/bn_2/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/gamma"
      }
    }
  }
}
node {
  name: "layer1/bn_2/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/bn_2/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_2/beta/Assign"
  op: "Assign"
  input: "layer1/bn_2/beta"
  input: "layer1/bn_2/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_2/beta/read"
  op: "Identity"
  input: "layer1/bn_2/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/beta"
      }
    }
  }
}
node {
  name: "layer1/bn_2/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/bn_2/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_2/moving_mean/Assign"
  op: "Assign"
  input: "layer1/bn_2/moving_mean"
  input: "layer1/bn_2/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_2/moving_mean/read"
  op: "Identity"
  input: "layer1/bn_2/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_2/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "layer1/bn_2/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "layer1/bn_2/moving_variance/Assign"
  op: "Assign"
  input: "layer1/bn_2/moving_variance"
  input: "layer1/bn_2/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_2/moving_variance/read"
  op: "Identity"
  input: "layer1/bn_2/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_variance"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/Switch"
  op: "Switch"
  input: "mode"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond/switch_t"
  op: "Identity"
  input: "layer1/bn_2/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond/switch_f"
  op: "Identity"
  input: "layer1/bn_2/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond/pred_id"
  op: "Identity"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond/Const"
  op: "Const"
  input: "^layer1/bn_2/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/Const_1"
  op: "Const"
  input: "^layer1/bn_2/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "layer1/bn_2/cond/FusedBatchNorm/Switch:1"
  input: "layer1/bn_2/cond/FusedBatchNorm/Switch_1:1"
  input: "layer1/bn_2/cond/FusedBatchNorm/Switch_2:1"
  input: "layer1/bn_2/cond/Const"
  input: "layer1/bn_2/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "layer1/conv_2/BiasAdd"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/BiasAdd"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "layer1/bn_2/gamma/read"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/gamma"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "layer1/bn_2/beta/read"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/beta"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "layer1/bn_2/cond/FusedBatchNorm_1/Switch"
  input: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_1"
  input: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_2"
  input: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_3"
  input: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "layer1/conv_2/BiasAdd"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/conv_2/BiasAdd"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "layer1/bn_2/gamma/read"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/gamma"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "layer1/bn_2/beta/read"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/beta"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "layer1/bn_2/moving_mean/read"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "layer1/bn_2/moving_variance/read"
  input: "layer1/bn_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_variance"
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond/Merge"
  op: "Merge"
  input: "layer1/bn_2/cond/FusedBatchNorm_1"
  input: "layer1/bn_2/cond/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_2/cond/Merge_1"
  op: "Merge"
  input: "layer1/bn_2/cond/FusedBatchNorm_1:1"
  input: "layer1/bn_2/cond/FusedBatchNorm:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_2/cond/Merge_2"
  op: "Merge"
  input: "layer1/bn_2/cond/FusedBatchNorm_1:2"
  input: "layer1/bn_2/cond/FusedBatchNorm:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_2/cond_1/Switch"
  op: "Switch"
  input: "mode"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond_1/switch_t"
  op: "Identity"
  input: "layer1/bn_2/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond_1/switch_f"
  op: "Identity"
  input: "layer1/bn_2/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond_1/pred_id"
  op: "Identity"
  input: "mode"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "layer1/bn_2/cond_1/Const"
  op: "Const"
  input: "^layer1/bn_2/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond_1/Const_1"
  op: "Const"
  input: "^layer1/bn_2/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "layer1/bn_2/cond_1/Merge"
  op: "Merge"
  input: "layer1/bn_2/cond_1/Const_1"
  input: "layer1/bn_2/cond_1/Const"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "layer1/bn_2/AssignMovingAvg/read"
  op: "Identity"
  input: "layer1/bn_2/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_mean"
      }
    }
  }
}
node {
  name: "layer1/bn_2/AssignMovingAvg/Sub"
  op: "Sub"
  input: "layer1/bn_2/AssignMovingAvg/read"
  input: "layer1/bn_2/cond/Merge_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@layer1/bn_2/moving_mean"
